; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 584361 1 3 4 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph2 - mode
	infrared0 - mode
	infrared3 - mode
	image1 - mode
	GroundStation0 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star1 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared3)
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
)
(:goal (and
	(pointing satellite0 Star1)
	(have_image Planet8 infrared3)
	(have_image Star9 spectrograph2)
	(have_image Star10 spectrograph2)
	(have_image Phenomenon11 spectrograph2)
	(have_image Phenomenon12 infrared3)
	(have_image Phenomenon13 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite0 star9 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star9)
   goals met: 0 of 7
3. (turn_to satellite0 star1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star1)
   goals met: 1 of 7
4. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 1 of 7
5. (turn_to satellite0 star9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star9)
   goals met: 0 of 7
6. (take_image satellite0 star9 instrument0 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 1 of 7
7. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   goals met: 1 of 7
8. (take_image satellite0 star10 instrument0 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 2 of 7
9. (turn_to satellite0 star1 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star1)
   goals met: 3 of 7
10. (turn_to satellite0 planet8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet8)
   goals met: 2 of 7
11. (take_image satellite0 planet8 instrument0 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 3 of 7
12. (turn_to satellite0 star1 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star1)
   goals met: 4 of 7
13. (turn_to satellite0 phenomenon13 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 7
14. (take_image satellite0 phenomenon13 instrument0 image1)
   added: (have_image phenomenon13 image1)
   goals met: 4 of 7
15. (turn_to satellite0 star1 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star1)
   goals met: 5 of 7
16. (turn_to satellite0 phenomenon12 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 7
17. (take_image satellite0 phenomenon12 instrument0 infrared3)
   added: (have_image phenomenon12 infrared3)
   goals met: 5 of 7
18. (turn_to satellite0 star1 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star1)
   goals met: 6 of 7
19. (turn_to satellite0 phenomenon11 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 7
20. (take_image satellite0 phenomenon11 instrument0 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 6 of 7
21. (turn_to satellite0 star1 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star1)
   goals met: 7 of 7
